perf-tests/results.txt
AkkaHttpVanillaMulti
================================================================================
---- Global Information --------------------------------------------------------
> request count                                    4991067 (OK=4991067 KO=0     )
> min response time                                      0 (OK=0      KO=-     )
> max response time                                    994 (OK=994    KO=-     )
> mean response time                                     6 (OK=6      KO=-     )
> std deviation                                          5 (OK=5      KO=-     )
> response time 50th percentile                          5 (OK=5      KO=-     )
> response time 75th percentile                          7 (OK=7      KO=-     )
> response time 95th percentile                         12 (OK=12     KO=-     )
> response time 99th percentile                         17 (OK=17     KO=-     )
> mean requests/sec                                16581.618 (OK=16581.618 KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                       4991033 (100%)
> 800 ms < t < 1200 ms                                  34 (  0%)
> t > 1200 ms                                            0 (  0%)
> failed                                                 0 (  0%)
================================================================================ 


AkkaHttpTapirMulti
================================================================================
---- Global Information --------------------------------------------------------
> request count                                    1789227 (OK=1789227 KO=0     )
> min response time                                      1 (OK=1      KO=-     )
> max response time                                   2631 (OK=2631   KO=-     )
> mean response time                                    17 (OK=17     KO=-     )
> std deviation                                         16 (OK=16     KO=-     )
> response time 50th percentile                         14 (OK=14     KO=-     )
> response time 75th percentile                         23 (OK=23     KO=-     )
> response time 95th percentile                         40 (OK=40     KO=-     )
> response time 99th percentile                         56 (OK=56     KO=-     )
> mean requests/sec                                5944.276 (OK=5944.276 KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                       1789162 (100%)
> 800 ms < t < 1200 ms                                  13 (  0%)
> t > 1200 ms                                           52 (  0%)
> failed                                                 0 (  0%)
================================================================================